# Pandas Exercise for Data Analysis

[Source](https://www.machinelearningplus.com/python/101-pandas-exercises-python/)

In [1]:
import numpy as np
import pandas as pd

To remember

```python
pd.concat([], axis=)
ser1.isin(ser2) 
np.percentile(ser, [q1, q2, ...])
ser.value_counts() # frequency count
ser.diff()
ser.pct_diff()
ser[mask] # where mask is a bool array
ser.replace(value_a, value_b)
",".join(list_)
pd.date_range(start, end, periods, freq) # freq = 'W-SAT' every saturday
df.rename(columns={old_col:new_col, ...}) # rename col/row names
df.iloc[::20, :] # select every 20th columns
ser.argsort()[::-1][n] # find the n-th argmax in ser
list_[start:end:skip] # slice the slide from start to end skipping every skip elements
list_[::-1] # reverse list
np.where(condition, a, b) # return [ a[i] if condition[i] else b[i] for i in range(n) ]
np.argwhere(a) # find the index of a that are non-zero (useful for bool array)
pd.get_dummies(df['a']) # get the categorical dummies of column a
df.groupby(['col1']).get_group('apple')
```

## Q1. How to import pandas and check the version?

In [2]:
print(f'Current pandas version is {pd.__version__}')

Current pandas version is 0.25.1

## Q2. How to create a series from a list, numpy array and dict?

In [3]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
pd.Series(mylist);

In [4]:
myarr = np.arange(26)
pd.Series(myarr);

In [5]:
mydict = dict(zip(mylist, myarr))
pd.Series(mydict);

## Q3. How to convert the index of a series into a column of a dataframe?

In [6]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

# My solution
pd.DataFrame({'newcol':ser.index}).head()

  newcol
0      a
1      b
2      c
3      e
4      d

In [7]:
# Their solution
ser.to_frame().reset_index().head()

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

## Q4. How to combine many series to form a dataframe?

In [8]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

# My solution
pd.DataFrame([ser1, ser2]).T.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

In [9]:
# One of their solution
pd.concat([ser1, ser2], axis=1).head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

## Q5. How to assign name to the series’ index?

In [10]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))

In [11]:
ser.name = 'alphabets'
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabets, dtype: object

## Q6. How to get the items of series A not present in series B?

In [12]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [13]:
# My solution
pd.Series( list(set(ser1).difference(ser2)) )

0    1
1    2
2    3
dtype: int64

In [14]:
# Their solution
ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

## Q7. How to get the items not common to both series A and series B?

In [15]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])

In [16]:
# My solution
ser1_prime = ser1[~ser1.isin(ser2)]
ser2_prime = ser2[~ser2.isin(ser1)]

pd.concat([ser1_prime, ser2_prime], axis=0)

0    1
1    2
2    3
2    6
3    7
4    8
dtype: int64

In [17]:
# Their solution 
ser_u = pd.Series(np.union1d(ser1, ser2))  # union
ser_i = pd.Series(np.intersect1d(ser1, ser2))  # intersect
ser_u[~ser_u.isin(ser_i)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

## Q8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [18]:
np.random.seed(0)
ser = pd.Series(np.random.normal(10, 5, 25))

In [19]:
np.percentile(ser, [0, 25, 50, 75, 100])

array([-2.76494908,  9.48390574, 12.05299251, 14.89368992, 21.34877312])

## Q9. How to get frequency counts of unique items of a series?

In [20]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))

In [21]:
ser.value_counts()

b    6
g    4
h    4
d    4
a    4
e    3
c    3
f    2
dtype: int64

## Q10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

In [22]:
np.random.seed(100)
ser = pd.Series(np.random.randint(1, 5, [12]))
ser;

In [23]:
print("Top 2 Freq:\n", ser.value_counts()[:2])
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser;

Top 2 Freq:
 4    4
1    4
dtype: int64

## Q11. How to bin a numeric series to 10 groups of equal size?

In [24]:
ser = pd.Series(np.random.random(20))

In [25]:
pd.qcut(ser, 
        q=[0, .1, .2, .3, .4, .5, .6, .7, .8, .9, 1], 
        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']
).head()

0    7th
1    9th
2    1st
3    6th
4    9th
dtype: category
Categories (10, object): [1st < 2nd < 3rd < 4th ... 7th < 8th < 9th < 10th]

## Q12. How to convert a numpy array to a dataframe of given shape?

In [26]:
ser = pd.Series(np.random.randint(1, 10, 35))

In [27]:
# My solution
pd.DataFrame(np.array(ser).reshape(7, 5))

   0  1  2  3  4
0  1  3  4  3  6
1  9  2  1  8  7
2  3  1  9  3  6
3  2  9  2  6  5
4  3  9  4  6  1
5  4  7  4  5  8
6  7  4  1  5  5

In [28]:
# Their solution
pd.DataFrame(ser.values.reshape(7,5))

   0  1  2  3  4
0  1  3  4  3  6
1  9  2  1  8  7
2  3  1  9  3  6
3  2  9  2  6  5
4  3  9  4  6  1
5  4  7  4  5  8
6  7  4  1  5  5

## Q13. How to find the positions of numbers that are multiples of 3 from a series?

In [29]:
ser = pd.Series(np.random.randint(1, 10, 7))

In [30]:
# My solution
ser[ser % 3 == 0].index

Int64Index([0, 4, 6], dtype='int64')

In [31]:
# Their solution 
np.argwhere(ser % 3 == 0)

/usr/local/lib/python3.7/site-packages/numpy/core/fromnumeric.py:61: FutureWarning: Series.nonzero() is deprecated and will be removed in a future version.Use Series.to_numpy().nonzero() instead
  return bound(*args, **kwds)

array([[0],
       [4],
       [6]])

## Q14. How to extract items at given positions from a series

In [32]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

In [33]:
ser[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

## Q15. How to stack two series vertically and horizontally ?

In [34]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [35]:
# Vertically
pd.concat([ser1, ser2], axis=0)
# or
ser1.append(ser2)
# Horizontally
pd.concat([ser1, ser2], axis=1);

## Q16. How to get the positions of items of series A in another series B?

In [36]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [37]:
# Their solution
[np.where(i == ser1)[0].tolist()[0] for i in ser2]

[5, 4, 0, 8]

## Q17. How to compute the mean squared error on a truth and predicted series?

In [38]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [39]:
MSE = ((truth-pred)**2).mean()
# or
MSE = np.mean((truth-pred)**2)

## Q18. How to convert the first character of each element in a series to uppercase?

In [40]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [41]:
# My solution (careful, on pd.DataFrame the function could call row or column not elements)
ser.apply(lambda s : s.capitalize())

0     How
1      To
2    Kick
3    Ass?
dtype: object

In [42]:
# Their solution
ser.map(lambda x: x.capitalize())

0     How
1      To
2    Kick
3    Ass?
dtype: object

## Q19. How to calculate the number of characters in each word in a series?

In [43]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [44]:
ser.apply(lambda s : len(s))

0    3
1    2
2    4
3    4
dtype: int64

## Q20. How to compute difference of differences between consecutive numbers of a series?

In [45]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [46]:
ser.diff().diff()

0    NaN
1    NaN
2    1.0
3    1.0
4    1.0
5    1.0
6    0.0
7    2.0
dtype: float64

## Q21. How to convert a series of date-strings to a timeseries?

In [47]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [48]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

## Q22. How to get the day of month, week number, day of year and day of week from a series of date strings?

In [49]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [50]:
# My solution
f = lambda t : [t.day, t.week, t.dayofyear, t.day_name(), t.year]
columns = ['Day', 'Week', 'Day of Year', 'Day of Week', 'Year']
pd.DataFrame([f(t) for t in pd.to_datetime(ser)], columns=columns)

   Day  Week  Day of Year Day of Week  Year
0    1    53            1      Friday  2010
1    2     5           33   Wednesday  2011
2    3     9           63    Saturday  2012
3    4    14           94    Thursday  2013
4    5    19          125      Monday  2014
5    6    23          157    Saturday  2015

## Q23. How to convert year-month string to dates corresponding to the 4th day of the month?

In [51]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])

In [52]:
pd.to_datetime( ser.apply(lambda t : '04 ' + t) )

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

## Q24. How to filter words that contain atleast 2 vowels from a series?

In [53]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

In [54]:
# Their solution
from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

## Q25. How to filter valid emails from a series?

In [55]:
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'

In [56]:
# My solution
import re

correct_emails = emails.apply(lambda s : s if re.search(pattern, s) else -1 )
correct_emails[correct_emails!=-1]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

In [57]:
# Their solution
import re

mask = emails.apply(lambda s : bool(re.search(pattern, s)))
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

## Q26. How to get the mean of a series grouped by another series?

In [58]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))

In [59]:
weights.groupby(fruit).mean()

apple     3.500000
banana    4.600000
carrot    8.333333
dtype: float64

## Q27. How to compute the euclidean distance between two series?

In [60]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

In [61]:
# My solution
np.sum( (p-q)**2 ) ** .5

18.16590212458495

In [62]:
# Their solution
np.linalg.norm(p-q)

18.16590212458495

## Q28. How to find all the local maxima (or peaks) in a numeric series?

In [63]:
ser = pd.Series([2, 10, 3, 4, 9, 10, 2, 7, 3])

In [64]:
dd = np.diff(np.sign(np.diff(ser)))
peak_locs = np.where(dd == -2)[0] + 1
peak_locs

array([1, 5, 7])

In [65]:
np.diff(ser)

array([ 8, -7,  1,  5,  1, -8,  5, -4])

## Q29. How to replace missing spaces in a string with the least frequent character?

In [66]:
my_str = 'dbc deb abed gade'

In [67]:
# My solution
ser = pd.Series(list(my_str))
freq = ser.value_counts().sort_values(ascending=True)
least_frequent_character = freq.index[0] if freq.index[0] != ' ' else freq.index[1]
ser[ser == ' ' ] = least_frequent_character
new_str = ''
for x in ser.values:
    new_str += x
new_str

'dbcgdebgabedggade'

In [68]:
# Their solution
ser = pd.Series(list('dbc deb abed gade'))
freq = ser.value_counts()
print(freq)
least_freq = freq.dropna().index[-1]
"".join(ser.replace(' ', least_freq))

d    4
e    3
     3
b    3
a    2
g    1
c    1
dtype: int64

'dbccdebcabedcgade'

## Q30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?

In [69]:
# My solution
N = 10
index = pd.date_range('2000-01-01', periods=N, freq='W-SAT')
pd.Series(np.random.randint(0, 100, N), index=index)

2000-01-01    58
2000-01-08    39
2000-01-15    94
2000-01-22    51
2000-01-29    30
2000-02-05    66
2000-02-12    24
2000-02-19    55
2000-02-26    17
2000-03-04    45
Freq: W-SAT, dtype: int64

## Q31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?

In [70]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
ser

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

In [71]:
# My solution
t_min, t_max = min(ser.index), max(ser.index)
nser = pd.Series(index=pd.date_range(t_min, t_max))

nser[nser.index.isin(ser.index)] = ser
nser.fillna(method='ffill')

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     3.0
Freq: D, dtype: float64

In [72]:
# Their solution
ser.resample('D').ffill()

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

## Q32. How to compute the autocorrelations of a numeric series?

In [73]:
ser = pd.Series(np.arange(20) + np.random.normal(1, 10, 20))

In [74]:
# My solution
autocorr = [ ser.autocorr(i) for i in range(1, 11) ]
print(autocorr)
print(f'Lag having highest correlation: {np.argmax(np.abs(autocorr))}')

[0.6260062451818191, 0.29339471167672976, 0.33153075262031384, 0.47760501685801454, 0.44394482067142543, -0.031256682474981146, -0.21685721077053347, 0.10494756310293221, 0.254771393637331, 0.17098052717648804]
Lag having highest correlation: 0

## Q33. How to import only every nth row from a csv file to create a dataframe?

In [75]:
# Their solution 1 : Use chunks and for-loop
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', chunksize=50)
df2 = pd.DataFrame()
for chunk in df:
    df2 = df2.append(chunk.iloc[0,:])

## Q34. How to change column values when importing csv to a dataframe?

## Q35. How to create a dataframe with rows as strides from a given series?

## Q36. How to import only specified columns from a csv file?

In [76]:
link = 'https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv'
df = pd.read_csv(link, usecols=['crim', 'medv'])
df.head()

      crim  medv
0  0.00632  24.0
1  0.02731  21.6
2  0.02729  34.7
3  0.03237  33.4
4  0.06905  36.2

## Q37. How to get the nrows, ncolumns, datatype, summary stats of each column of a dataframe? Also get the array and list equivalent.

## Q38. How to extract the row and column number of a particular cell with given criterion?

## Q39. How to rename a specific columns in a dataframe?

In [77]:
# Their solution
df=df.rename(columns = {'Type':'CarType'})

## Q40. How to check if a dataframe has any missing values?

In [78]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [79]:
# My solution
df.isna().any().any()

True

In [80]:
# Their solution
df.isnull().values.any()

True

## Q41. How to count the number of missing values in each column?

In [81]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [82]:
df.isna().sum(), df.isna().sum().argmax()

/usr/local/Cellar/ipython/7.8.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  """Entry point for launching an IPython kernel.

(Manufacturer           4
 Model                  1
 Type                   3
 Min.Price              7
 Price                  2
 Max.Price              5
 MPG.city               9
 MPG.highway            2
 AirBags                6
 DriveTrain             7
 Cylinders              5
 EngineSize             2
 Horsepower             7
 RPM                    3
 Rev.per.mile           6
 Man.trans.avail        5
 Fuel.tank.capacity     8
 Passengers             2
 Length                 4
 Wheelbase              1
 Width                  6
 Turn.circle            5
 Rear.seat.room         4
 Luggage.room          19
 Weight                 7
 Origin                 5
 Make                   3
 dtype: int64, 'Luggage.room')

## Q42. How to replace missing values of multiple numeric columns with the mean?

In [83]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [84]:
df.fillna(df.mean().to_dict())

,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,DriveTrain,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,Acura,Integra,Small,12.900000,15.9,18.800000,25.0,31.0,None,Front,...,5.0,177.0,102.0,68.000000,37.0,26.5,13.986486,2705.0,non-USA,Acura Integra
1,NaN,Legend,Midsize,29.200000,33.9,38.700000,18.0,25.0,Driver & Passenger,Front,...,5.0,195.0,115.0,71.000000,38.0,30.0,15.000000,3560.0,non-USA,Acura Legend
2,Audi,90,Compact,25.900000,29.1,32.300000,20.0,26.0,Driver only,Front,...,5.0,180.0,102.0,67.000000,37.0,28.0,14.000000,3375.0,non-USA,Audi 90
3,Audi,100,Midsize,17.118605,37.7,44.600000,19.0,26.0,Driver & Passenger,NaN,...,6.0,193.0,106.0,69.448276,37.0,31.0,17.000000,3405.0,non-USA,Audi 100
4,BMW,535i,Midsize,17.118605,30.0,21.459091,22.0,30.0,NaN,Rear,...,4.0,186.0,109.0,69.000000,39.0,27.0,13.000000,3640.0,non-USA,BMW 535i
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
88,Volkswagen,Eurovan,Van,16.600000,19.7,22.700000,17.0,21.0,None,Front,...,7.0,187.0,115.0,72.000000,38.0,34.0,13.986486,3960.0,NaN,Volkswagen Eurovan
89,Volkswagen,Passat,Compact,17.600000,20.0,22.400000,21.0,30.0,None,Front,...,5.0,180.0,103.0,67.000000,35.0,31.5,14.000000,2985.0,non-USA,Volkswagen Passat
90,Volkswagen,Corrado,Sporty,22.900000,23.3,23.700000,18.0,25.0,None,Front,...,4.0,159.0,97.0,66.000000,36.0,26.0,15.000000,2810.0,non-USA,Volkswagen Corrado
91,Volvo,240,Compact,21.800000,22.7,23.500000,21.0,28.0,Driver only,Rear,...,5.0,190.0,104.0,67.000000,37.0,29.5,14.000000,2985.0,non-USA,Volvo 240
92,NaN,850,Midsize,24.800000,26.7,28.500000,20.0,28.0,Driver & Passenger,Front,...,5.0,184.0,105.0,69.000000,38.0,30.0,15.000000,3245.0,non-USA,Volvo 850

## Q43. How to use apply function on existing columns with global variables as additional arguments?

In [85]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [86]:
df_out = df[ ['Min.Price', 'Max.Price'] ]
def f(col):
    if col.name == 'Min.Price':
        return col.fillna(col.mean(skipna=True))
    elif col.name == 'Max.Price':
        return col.fillna(col.median(skipna=True))
    else:
        return -1
    
df_out.apply(f)

    Min.Price  Max.Price
0   12.900000      18.80
1   29.200000      38.70
2   25.900000      32.30
3   17.118605      44.60
4   17.118605      19.15
..        ...        ...
88  16.600000      22.70
89  17.600000      22.40
90  22.900000      23.70
91  21.800000      23.50
92  24.800000      28.50

[93 rows x 2 columns]

## Q44. How to select a specific column from a dataframe as a dataframe instead of a series?

In [87]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [88]:
df[['a']]

    a
0   0
1   5
2  10
3  15

## Q45. How to change the order of columns of a dataframe?

In [89]:
# Their solutions
# Solution Q1
df[list('cbade')]

# Solution Q2 - No hard coding
def switch_columns(df, col1=None, col2=None):
    colnames = df.columns.tolist()
    i1, i2 = colnames.index(col1), colnames.index(col2)
    colnames[i2], colnames[i1] = colnames[i1], colnames[i2]
    return df[colnames]

df1 = switch_columns(df, 'a', 'c')

# Solution Q3
df[sorted(df.columns)]
# or
df.sort_index(axis=1, ascending=False, inplace=True)

## Q46. How to set the number of rows and columns displayed in the output?

In [90]:
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

In [91]:
pd.describe_option()

compute.use_bottleneck : bool
    Use the bottleneck library to accelerate if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]compute.use_numexpr : bool
    Use the numexpr library to accelerate computation if it is installed,
    the default is True
    Valid values: False,True
    [default: True] [currently: True]display.chop_threshold : float or None
    if set to a float value, all float values smaller then the given threshold
    will be displayed as exactly 0 by repr and friends.
    [default: None] [currently: None]display.colheader_justify : 'left'/'right'
    Controls the justification of column headers. used by DataFrameFormatter.
    [default: right] [currently: right]display.column_space No description available.
    [default: 12] [currently: 12]display.date_dayfirst : boolean
    When True, prints and parses dates with the day first, eg 20/01/2005
    [default: False] [currently: False]display.date_yearfirst : boolean
    When True, prints and parses dates with the year first, eg 2005/01/20
    [default: False] [currently: False]display.encoding : str/unicode
    Defaults to the detected encoding of the console.
    Specifies the encoding to be used for strings returned by to_string,
    these are generally strings meant to be displayed on the console.
    [default: UTF-8] [currently: UTF-8]display.expand_frame_repr : boolean
    Whether to print out the full DataFrame repr for wide DataFrames across
    multiple lines, `max_columns` is still respected, but the output will
    wrap-around across multiple "pages" if its width exceeds `display.width`.
    [default: True] [currently: True]display.float_format : callable
    The callable should accept a floating point number and return
    a string with the desired format of the number. This is used
    in some places like SeriesFormatter.
    See formats.format.EngFormatter for an example.
    [default: None] [currently: None]display.html.border : int
    A ``border=value`` attribute is inserted in the ``<table>`` tag
    for the DataFrame HTML repr.
    [default: 1] [currently: 1]display.html.table_schema : boolean
    Whether to publish a Table Schema representation for frontends
    that support it.
    (default: False)
    [default: False] [currently: False]display.html.use_mathjax : boolean
    When True, Jupyter notebook will process table contents using MathJax,
    rendering mathematical expressions enclosed by the dollar symbol.
    (default: True)
    [default: True] [currently: True]display.large_repr : 'truncate'/'info'
    For DataFrames exceeding max_rows/max_cols, the repr (and HTML repr) can
    show a truncated table (the default from 0.13), or switch to the view from
    df.info() (the behaviour in earlier versions of pandas).
    [default: truncate] [currently: truncate]display.latex.escape : bool
    This specifies if the to_latex method of a Dataframe uses escapes special
    characters.
    Valid values: False,True
    [default: True] [currently: True]display.latex.longtable :bool
    This specifies if the to_latex method of a Dataframe uses the longtable
    format.
    Valid values: False,True
    [default: False] [currently: False]display.latex.multicolumn : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: True] [currently: True]display.latex.multicolumn_format : bool
    This specifies if the to_latex method of a Dataframe uses multicolumns
    to pretty-print MultiIndex columns.
    Valid values: False,True
    [default: l] [currently: l]display.latex.multirow : bool
    This specifies if the to_latex method of a Dataframe uses multirows
    to pretty-print MultiIndex rows.
    Valid values: False,True
    [default: False] [currently: False]display.latex.repr : boolean
    Whether to produce a latex DataFrame representation for jupyter
    environments that support it.
    (default: False)
    [default: False] [currently: False]display.max_categories : int
    This sets the maximum number of categories pandas should output when
    printing out a `Categorical` or a Series of dtype "category".
    [default: 8] [currently: 8]display.max_columns : int
    If max_cols is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the width of the terminal and print a truncated object which fits
    the screen width. The IPython notebook, IPython qtconsole, or IDLE
    do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 20] [currently: 10]display.max_colwidth : int
    The maximum width in characters of a column in the repr of
    a pandas data structure. When the column overflows, a "..."
    placeholder is embedded in the output.
    [default: 50] [currently: 50]display.max_info_columns : int
    max_info_columns is used in DataFrame.info method to decide if
    per column information will be printed.
    [default: 100] [currently: 100]display.max_info_rows : int or None
    df.info() will usually show null-counts for each column.
    For large frames this can be quite slow. max_info_rows and max_info_cols
    limit this null check only to frames with smaller dimensions than
    specified.
    [default: 1690785] [currently: 1690785]display.max_rows : int
    If max_rows is exceeded, switch to truncate view. Depending on
    `large_repr`, objects are either centrally truncated or printed as
    a summary view. 'None' value means unlimited.

    In case python/IPython is running in a terminal and `large_repr`
    equals 'truncate' this can be set to 0 and pandas will auto-detect
    the height of the terminal and print a truncated object which fits
    the screen height. The IPython notebook, IPython qtconsole, or
    IDLE do not run in a terminal and hence it is not possible to do
    correct auto-detection.
    [default: 60] [currently: 10]display.max_seq_items : int or None
    when pretty-printing a long sequence, no more then `max_seq_items`
    will be printed. If items are omitted, they will be denoted by the
    addition of "..." to the resulting string.

    If set to None, the number of items to be printed is unlimited.
    [default: 100] [currently: 100]display.memory_usage : bool, string or None
    This specifies if the memory usage of a DataFrame should be displayed when
    df.info() is called. Valid values True,False,'deep'
    [default: True] [currently: True]display.min_rows : int
    The numbers of rows to show in a truncated view (when `max_rows` is
    exceeded). Ignored when `max_rows` is set to None or 0. When set to
    None, follows the value of `max_rows`.
    [default: 10] [currently: 10]display.multi_sparse : boolean
    "sparsify" MultiIndex display (don't display repeated
    elements in outer levels within groups)
    [default: True] [currently: True]display.notebook_repr_html : boolean
    When True, IPython notebook will use html representation for
    pandas objects (if it is available).
    [default: True] [currently: True]display.pprint_nest_depth : int
    Controls the number of nested levels to process when pretty-printing
    [default: 3] [currently: 3]display.precision : int
    Floating point output precision (number of significant digits). This is
    only a suggestion
    [default: 6] [currently: 6]display.show_dimensions : boolean or 'truncate'
    Whether to print out dimensions at the end of DataFrame repr.
    If 'truncate' is specified, only print out the dimensions if the
    frame is truncated (e.g. not display all rows and/or columns)
    [default: truncate] [currently: truncate]display.unicode.ambiguous_as_wide : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]display.unicode.east_asian_width : boolean
    Whether to use the Unicode East Asian Width to calculate the display text
    width.
    Enabling this may affect to the performance (default: False)
    [default: False] [currently: False]display.width : int
    Width of the display in characters. In case python/IPython is running in
    a terminal this can be set to None and pandas will correctly auto-detect
    the width.
    Note that the IPython notebook, IPython qtconsole, or IDLE do not run in a
    terminal and hence it is not possible to correctly detect the width.
    [default: 80] [currently: 80]io.excel.ods.reader : string
    The default Excel reader engine for 'ods' files. Available options:
    auto, odf.
    [default: auto] [currently: auto]io.excel.xls.reader : string
    The default Excel reader engine for 'xls' files. Available options:
    auto, xlrd.
    [default: auto] [currently: auto]io.excel.xls.writer : string
    The default Excel writer engine for 'xls' files. Available options:
    auto, xlwt.
    [default: auto] [currently: auto]io.excel.xlsm.reader : string
    The default Excel reader engine for 'xlsm' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]io.excel.xlsm.writer : string
    The default Excel writer engine for 'xlsm' files. Available options:
    auto, openpyxl.
    [default: auto] [currently: auto]io.excel.xlsx.reader : string
    The default Excel reader engine for 'xlsx' files. Available options:
    auto, xlrd, openpyxl.
    [default: auto] [currently: auto]io.excel.xlsx.writer : string
    The default Excel writer engine for 'xlsx' files. Available options:
    auto, openpyxl, xlsxwriter.
    [default: auto] [currently: auto]io.hdf.default_format : format
    default format writing format, if None, then
    put will default to 'fixed' and append will default to 'table'
    [default: None] [currently: None]io.hdf.dropna_table : boolean
    drop ALL nan rows when appending to a table
    [default: False] [currently: False]io.parquet.engine : string
    The default parquet reader/writer engine. Available options:
    'auto', 'pyarrow', 'fastparquet', the default is 'auto'
    [default: auto] [currently: auto]mode.chained_assignment : string
    Raise an exception, warn, or no action if trying to use chained assignment,
    The default is warn
    [default: warn] [currently: warn]mode.sim_interactive : boolean
    Whether to simulate interactive mode for purposes of testing
    [default: False] [currently: False]mode.use_inf_as_na : boolean
    True means treat None, NaN, INF, -INF as NA (old way),
    False means None and NaN are null, but INF, -INF are not NA
    (new way).
    [default: False] [currently: False]mode.use_inf_as_null : boolean
    use_inf_as_null had been deprecated and will be removed in a future
    version. Use `use_inf_as_na` instead.
    [default: False] [currently: False]
    (Deprecated, use `mode.use_inf_as_na` instead.)plotting.backend : str
    The plotting backend to use. The default value is "matplotlib", the
    backend provided with pandas. Other backends can be specified by
    prodiving the name of the module that implements the backend.
    [default: matplotlib] [currently: matplotlib]plotting.matplotlib.register_converters : bool
    Whether to register converters with matplotlib's units registry for
    dates, times, datetimes, and Periods. Toggling to False will remove
    the converters, restoring any converters that pandas overwrote.
    [default: True] [currently: True]

## Q47. How to format or suppress scientific notations in a pandas dataframe?

In [92]:
pd.options.display.float_format = '{:.4f}'.format

## Q48. How to format all the values in a dataframe as percentages?

In [93]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df

   random
0  0.0305
1  0.8596
2  0.4398
3  0.5604

In [94]:
# Their solution
out = df.style.format({
    'random': '{0:.2%}'.format,
})
out

## Q49. How to filter every nth row in a dataframe?

In [95]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv')

In [96]:
# My solution
n_rows = df.shape[0]
index = [ i for i in range(n_rows) if i % 20 == 0 ]
df.loc[index, ['Manufacturer', 'Model', 'Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

In [97]:
# Their solution
df.iloc[::20, :][['Manufacturer', 'Model', 'Type']]

   Manufacturer    Model     Type
0         Acura  Integra    Small
20     Chrysler  LeBaron  Compact
40        Honda  Prelude   Sporty
60      Mercury   Cougar  Midsize
80       Subaru   Loyale    Small

## Q50. How to create a primary key index by combining relevant columns?

In [98]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/Cars93_miss.csv', usecols=[0,1,2,3,5])
df.head()

  Manufacturer    Model     Type  Min.Price  Max.Price
0        Acura  Integra    Small    12.9000    18.8000
1          NaN   Legend  Midsize    29.2000    38.7000
2         Audi       90  Compact    25.9000    32.3000
3         Audi      100  Midsize        nan    44.6000
4          BMW     535i  Midsize        nan        nan

In [99]:
dff = df[['Manufacturer', 'Model', 'Type']]
dff[dff.isna()] = 'missing'
df[['Maufacturer', 'Model', 'Type']] = dff

/usr/local/Cellar/ipython/7.8.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.7/site-packages/pandas/core/frame.py:3515: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._where(-key, value, inplace=True)

In [100]:
# Their solution
df[['Manufacturer', 'Model', 'Type']] = df[['Manufacturer', 'Model', 'Type']].fillna('missing')
df.index = df.Manufacturer + '_' + df.Model + '_' + df.Type
df.index.is_unique

True

## Q51. How to get the row number of the nth largest value in a column?

In [101]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

In [106]:
n = 5
df['a'].argsort()[::-1][n]

8

## Q52. How to find the position of the nth largest value greater than a given value?

In [152]:
ser = pd.Series(np.random.randint(1, 100, 15))
ser.to_list(), ser.mean()

([34, 16, 18, 89, 24, 60, 9, 41, 78, 48, 46, 26, 32, 11, 39],
 38.06666666666667)

In [153]:
# My solution
m = ser.mean()
ser[ser>m].argsort().index[1]

5

In [154]:
# Their solution
np.argwhere( ser > ser.mean())[1]

array([5])

## Q53. How to get the last n rows of a dataframe with row sum > 100?

In [155]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))

In [175]:
# My solution
df.loc[ df.sum(axis=1) > 100].iloc[-2:]

     0   1   2   3
11  34  28  24  38
12  26  15  26  35

In [178]:
# Their solution
rowsums = df.apply(np.sum, axis=1)
df.iloc[np.where(rowsums > 100)[0][-2:], :]

     0   1   2   3
11  34  28  24  38
12  26  15  26  35

## Q54. How to find and cap outliers from a series or dataframe column?

In [181]:
ser = pd.Series(np.logspace(-2, 2, 30))

In [197]:
low, high = ser.quantile([0.05, 0.95])
ser[ser < low] = low
ser[ser > high] = high
ser

0     0.0187
1     0.0187
2     0.0189
3     0.0259
4     0.0356
       ...
25   28.0722
26   38.5662
27   52.9832
28   53.5314
29   53.5314
Length: 30, dtype: float64

## Q55. How to reshape a dataframe to the largest possible square after removing the negative values?

In [195]:
df = pd.DataFrame(np.random.randint(-20, 50, 100).reshape(10,-1))

## Q56. How to swap two rows of a dataframe?

In [198]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

In [200]:
def swap_rows(df, i1, i2):
    a, b = df.iloc[i1, :].copy(), df.iloc[i2, :].copy()
    df.iloc[i1, :], df.iloc[i2, :] = b, a
    return df

print(swap_rows(df, 1, 2))

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

## Q57. How to reverse the rows of a dataframe?

In [201]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

In [202]:
df.iloc[::-1]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

## Q58. How to create one-hot encodings of a categorical variable (dummy variables)?

In [203]:
df = pd.DataFrame(np.arange(25).reshape(5,-1), columns=list('abcde'))

In [209]:
dummies = pd.get_dummies(df['a'])
pd.concat([dummies, df[list('bcde')]], axis=1)

   0  5  10  15  20   b   c   d   e
0  1  0   0   0   0   1   2   3   4
1  0  1   0   0   0   6   7   8   9
2  0  0   1   0   0  11  12  13  14
3  0  0   0   1   0  16  17  18  19
4  0  0   0   0   1  21  22  23  24

## Q59. Which column contains the highest number of row-wise maximum values?

In [224]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('abcd'))

In [225]:
# Their solution
df.apply(np.argmax, axis=1).value_counts().index[0]

'a'

## Q60. How to create a new column that contains the row number of nearest column by euclidean distance?

In [248]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1), columns=list('pqrs'), index=list('abcdefghij'))

In [249]:
[ np.linalg.norm(df.iloc[1] - df.iloc[j]) for j in range(df.shape[0])]

# My solution

nearest_row, nearest_dist = [], []

for i, row1 in df.iterrows():
    
    min_idx, min_dist = i, float('inf')
    
    for j, row2 in df.drop(i).iterrows():
        
        dist = np.linalg.norm( row1 - row2 )
        
        if dist < min_dist:
            min_idx, min_dist = i, dist
        
    nearest_row.append(min_idx)
    nearest_dist.append(min_dist)

df['nearest row'] = nearest_row
df['nearest dist'] = nearest_dist
df

    p   q   r   s nearest row  nearest dist
a  95  77  94  48           a       46.3681
b   9  90  17  60           b       42.2256
c  87  97  16  38           c       35.7491
d  58  36  91  71           d       34.0881
e  77  42  70  53           e       34.0881
f  40  76  80   8           f       67.8528
g  26  83  34  94           g       42.2256
h  43  27  35  21           h       54.6626
i  65  85  35  55           i       35.7491
j  26  24  52  70           j       51.8652

## Q61. How to know the maximum possible correlation value of each column against other columns?

In [263]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1), columns=list('pqrstuvwxy'), index=list('abcdefgh'))

In [264]:
# My solution
( df.corr().apply(np.abs) - np.eye(len(df.columns)) ).max()

p   0.6525
q   0.5129
r   0.5356
s   0.4814
t   0.6525
u   0.5209
v   0.6146
w   0.5785
x   0.5356
y   0.5785
dtype: float64

In [265]:
# Their solution
abs_corrmat = np.abs(df.corr())
max_corr = abs_corrmat.apply(lambda x: sorted(x)[-2])
print('Maximum Correlation possible for each column: ', np.round(max_corr.tolist(), 2))

Maximum Correlation possible for each column:  [0.65 0.51 0.54 0.48 0.65 0.52 0.61 0.58 0.54 0.58]

## Q62. How to create a column containing the minimum by maximum of each row?

In [266]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

In [270]:
# My solution
df.min(axis=1)/ df.max(axis=1)

0   0.0256
1   0.0947
2   0.2273
3   0.0110
4   0.0430
5   0.1348
6   0.2421
7   0.0722
dtype: float64

In [271]:
# Their solution
df.apply(lambda x: np.min(x)/np.max(x), axis=1)

0   0.0256
1   0.0947
2   0.2273
3   0.0110
4   0.0430
5   0.1348
6   0.2421
7   0.0722
dtype: float64

## Q63. How to create a column that contains the penultimate value in each row?

In [278]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df

    0   1   2   3   4   5   6   7   8   9
0  77  26  26  37  40  92  55   5  35  92
1  43  57  10  12  55  11  45  49  74  62
2  75  60  79  76  86  15  53  29  24  83
3  83  81  18  18  57  95  73  93  54   3
4  95  27  10  54  51  68  71  66  38  26
5   5  88  77  90  49  85  96  79  97  47
6  36  67  66  83  78  28  95  21  47  62
7  13  59  51  49  99  52  61  83  25  35

In [288]:
df.apply( lambda row : row.sort_values().unique()[-2], axis=1)

0    77
1    62
2    83
3    93
4    71
5    96
6    83
7    83
dtype: int64

## Q64. How to normalize all columns in a dataframe?

In [292]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df.head()

    0   1   2   3   4   5   6   7   8   9
0  96  78  16  45  78  15  81  71  53  89
1  68  75   4  68  17  68  81  38  93  33
2  97  21  75  93  65  52  22  57  28  32
3  57  68  55  40  38  95  34  46  79  37
4  46  79  81  95  43  91  83  88  90  53

In [295]:
(df - df.mean()) / df.std();

In [296]:
(df - df.min()) / (df.max() - df.min());

## Q65. How to compute the correlation of each row with the suceeding row?

In [300]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
df.head()

    0   1   2   3   4   5   6   7   8   9
0  44   7  23  17  89  29  70  59  19  41
1  98  99  52  64  57  15  82  68  17  99
2  61  37  84  68   6  45  34  51  19  51
3  49   2  47  97  29   8  70  31  62  89
4  23  18  85   3  40  46  60  12  77  24

In [302]:
[ df.iloc[i].corr( df.iloc[i+1] ) for i in range(df.shape[0]-1) ]

[0.1393411282478993,
 0.20482720932061182,
 0.2653713034921578,
 -0.04006355096995864,
 0.40390461398402105,
 -0.5727783730772334,
 0.2787946696966961]

## Q66. How to replace both the diagonals of dataframe with 0?

In [303]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))

In [317]:
# My solution
n = len(df.index)
mask = np.eye(n) + np.fliplr(np.eye(n))
pd.DataFrame(np.where(mask, 0, df))

    0   1   2   3   4   5   6   7   8   9
0   0  31  38  41  58  35  68  65  14   0
1  85   0  98  13  23  89  89  48   0  23
2  91   6   0  53  38  44  27   0  78  65
3  81  85  71   0  70  27   0  48  30  27
4  37  21  54  15   0   0  93  70  94  34
5  89   6   9  30   0   0  76  95  91  25
6  48  94  41   0  45  50   0  27  12  75
7  74  13   0  10  91   8   7   0  73  43
8  50   0  70  72  43  47  63  97   0  79
9   0  10  62  75  10  53  72  29  67   0

In [319]:
# Their solution
for i in range(df.shape[0]):
    df.iat[i, i] = 0
    df.iat[df.shape[0]-i-1, i] = 0
df

    0   1   2   3   4   5   6   7   8   9
0   0  31  38  41  58  35  68  65  14   0
1  85   0  98  13  23  89  89  48   0  23
2  91   6   0  53  38  44  27   0  78  65
3  81  85  71   0  70  27   0  48  30  27
4  37  21  54  15   0   0  93  70  94  34
5  89   6   9  30   0   0  76  95  91  25
6  48  94  41   0  45  50   0  27  12  75
7  74  13   0  10  91   8   7   0  73  43
8  50   0  70  72  43  47  63  97   0  79
9   0  10  62  75  10  53  72  29  67   0

## Q67. How to get the particular group of a groupby dataframe by key?

In [320]:
df = pd.DataFrame({'col1': ['apple', 'banana', 'orange'] * 3,
                   'col2': np.random.rand(9),
                   'col3': np.random.randint(0, 15, 9)})

df_grouped = df.groupby(['col1'])

In [324]:
df_grouped.get_group('apple')

    col1   col2  col3
0  apple 0.2414     1
3  apple 0.9953    11
6  apple 0.1147     7

## Q68. How to get the n’th largest value of a column when grouped by another column?

In [325]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

In [339]:
df.groupby(['fruit']).get_group('banana')['rating'].sort_values().values[-2]

0.3636516664196304

## Q69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?

In [340]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

In [347]:
df.groupby('fruit', as_index=False)['price'].mean()

    fruit   price
0   apple 10.0000
1  banana  5.6667
2  orange 12.6667

## Q70. How to join two dataframes by 2 columns so they have only the common rows?

In [348]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

In [349]:
df1

    fruit  weight  price
0   apple    high      0
1  banana  medium      3
2  orange     low      1
3   apple    high      2
4  banana  medium      9
5  orange     low     13
6   apple    high     12
7  banana  medium      0
8  orange     low      9

In [354]:
# My solution
pd.concat([df1, df2], axis=1).dropna()

    fruit  weight  price  pazham  kilo   price
0   apple    high      0   apple  high  8.0000
1  banana  medium      3  orange   low  1.0000
2  orange     low      1    pine  high 10.0000
3   apple    high      2   apple   low 13.0000
4  banana  medium      9  orange  high  5.0000
5  orange     low     13    pine   low  2.0000

In [355]:
# Their solution
pd.merge(df1, df2, how='inner', left_on=['fruit', 'weight'], right_on=['pazham', 'kilo'], suffixes=['_left', '_right'])

    fruit weight  price_left  pazham  kilo  price_right
0   apple   high           0   apple  high            8
1   apple   high           2   apple  high            8
2   apple   high          12   apple  high            8
3  orange    low           1  orange   low            1
4  orange    low          13  orange   low            1
5  orange    low           9  orange   low            1